app/controllers/bikes_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def new
        @user = User.find(current_user.id)

SELECT "bikes".* FROM "bikes" WHERE "bikes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def update
        @bike = Bike.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "bikes" ("title", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "new bike"], ["created_at", "2020-08-17 20:18:15.882626"], ["updated_at", "2020-08-17 20:18:15.882626"], ["user_id", 2]]
---
    def create
        @bike = Bike.new(bike_params)
        @user = User.find(current_user.id)
        @bike.user = @user
        if @bike.save

SELECT "bikes".* FROM "bikes" WHERE "bikes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        @bike = Bike.find(params[:id])